<a href="https://colab.research.google.com/github/Rogerio-mack/MDJ/blob/main/EADMDJ_A3_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<head>
  <meta name="author" content="Rogério de Oliveira">
  <meta institution="author" content="Universidade Presbiteriana Mackenzie">
</head>

<img src="http://meusite.mackenzie.br/rogerio/mackenzie_logo/UPM.2_horizontal_vermelho.jpg" width=300, align="right">
<h1 align=left><font size = 5, style="color:rgb(0,0,0)"> EAD <b>Mineração de Dados para Jogos </b> </font></h1>

<h1 align=left><font size = 6, style="color:rgb(200,0,0)">A3 Exploração dos Dados com Pandas</font></h1>
<hr>

# Recursos

Abaixo recursos que serão úteis para você aprender e empregar o **Pandas**.

**Oficial**
> https://pandas.pydata.org/ <br>
> https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf <br>

# O que é Pandas?

O `Pandas` é um biblioteca Python para manipulação e análise de dados. Ele permite organizar dados em dois tipos de estruturas, Séries e DataFrames e operar transformações sobre essas coleções, ou subconjuntos delas, sem a necessidade de laços de programação.

Veja abaixo um sumário das transformações de dados com Pandas.

## Imports

In [ ]:
import pandas as pd
import numpy as np

# Criando Séries e Dataframes
Existem dois tipos de objetos principais nos pandas: **Dataframes** e **Séries**.

Um **DataFrame** é uma tabela que contém uma matriz de entradas individuais, cada uma com um determinado valor. Cada entrada corresponde a uma linha (ou registro) e uma coluna. Já uma **Série** pode ser entendida como uma Lista, em que todos os elementos são do mesmo tipo, ou um Coluna de Dados de um dataframe

In [ ]:
BMIseries = pd.Series([0, 18.50, 25, np.NaN])


BMIclass = pd.DataFrame({'Classification': ['UnderWeight','Normal Range','Overweight','Obese'], 
                        'Min': [0, 18.50, 25, 30],
                        'Max': [18.49, 24.99, 29.99, 99]})

print(BMIclass)

BMIclass = pd.DataFrame({'Classification': ['UnderWeight','Normal Range','Overweight','Obese'], 
                        'Min': [0, 18.50, 25, 30],
                        'Max': [18.49, 24.99, 29.99, 99]}, index=['A','B','C','D'])

print(BMIclass)
print(type(BMIclass))

BMImin = pd.Series([0, 18.50, 25, 30])
print(BMImin)
print(type(BMImin))

  Classification   Min    Max
0    UnderWeight   0.0  18.49
1   Normal Range  18.5  24.99
2     Overweight  25.0  29.99
3          Obese  30.0  99.00
  Classification   Min    Max
A    UnderWeight   0.0  18.49
B   Normal Range  18.5  24.99
C     Overweight  25.0  29.99
D          Obese  30.0  99.00
<class 'pandas.core.frame.DataFrame'>
0     0.0
1    18.5
2    25.0
3    30.0
dtype: float64
<class 'pandas.core.series.Series'>

# Lendo e Gravando um DataFrame

O Pandas pode ler arquivos **.CSV** e muitos outros formatos (JSON, XLSX, JSON, SQL etc) diretamente e dataframes ou mesmo gravar esses arquivos. Você talvez esperasse uma melhor simetria desses comandos, mas o read_csv é um método pandas e o to_csv um método do dataframe o que resulta em algumas diferenças. Mas na maior parte do tempo você vai ler dados.


| Format        | Read           | Save          |
| ------------- |:--------------:| ----------------:|
| csv           | `pd.read_csv()`  |`df.to_csv()`     |
| json          | `pd.read_json()` |`df.to_json()`    |
| xlsx          | `pd.read_excel()`|`df.to_excel()`   |
| hdf           | `pd.read_hdf()`  |`df.to_hdf()`     |
| sql           | `pd.read_sql()`  |`df.to_sql()`     |

In [ ]:
import pandas as pd
import numpy as np

import os          
print(os.getcwd())

BMIclass.to_csv(os.getcwd() + '\BMIfile.csv', index = None, header=True)

if 'BMIfile.csv' in os.listdir(os.getcwd()):
    print('Arquivo gravado com sucesso em ' + os.getcwd())

C:\Users\rdeol
Arquivo gravado com sucesso em C:\Users\rdeol

In [ ]:
BMInew = pd.read_csv(os.getcwd() + '\BMIfile.csv', header=0)

print(BMInew)

  Classification   Min    Max
0    UnderWeight   0.0  18.49
1   Normal Range  18.5  24.99
2     Overweight  25.0  29.99
3          Obese  30.0  99.00

Os dados podem também podem ser lidos diretamente da web e você pode querer usar os comandos **head()** e **shape()** para uma primeira inspeção dos dados obtidos.

In [ ]:

BMIweb = pd.read_csv('http://meusite.mackenzie.br/rogerio/TIC/BMIfile.csv', header=0)

print(BMIweb)

print(BMIweb.shape) # número de linhas e atributos
print(BMIweb.head())

  Classification   Min    Max
0    UnderWeight   0.0  18.49
1   Normal Range  18.5  24.99
2     Overweight  25.0  29.99
3          Obese  30.0  99.00
(4, 3)
  Classification   Min    Max
0    UnderWeight   0.0  18.49
1   Normal Range  18.5  24.99
2     Overweight  25.0  29.99
3          Obese  30.0  99.00

# Seleção de Dados

Selecionar valores específicos de um DataFrame ou Series será necessário para quase todas as operações de dados que você executar. Você normalmente não deseja trabalhar com **"todos"** os dados mas com alguns registros (linhas) que satisfazem alguma condição e talvez apenas com alguns atributos (colunas) com os dados que você quer. Isso é um **slice** dos dados e aqui você aprenderá como fazer a seleção de linhas, colunas e linhas+colunas para diferentes slices dos dados.

Aprenda à seguir como fazer seleções de dados de interesse através de uma exemplo de dados reais.

# **CASE:** **European Energy:** Qual o tipo de Energia mais produzido na Europa? O uso de fontes renováveis já é significativo? 

[European Energy link](https://github.com/rfordatascience/tidytuesday/blob/master/data/2020/2020-08-04/readme.md)

Explore aqui como é a produção de Energia na Europa.

# Lendo os Dados

In [ ]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-08-04/energy_types.csv') 

df.head()

  country country_name                  type  ...     2016     2017       2018
0      BE      Belgium  Conventional thermal  ...  30728.0  31316.0  30092.635
1      BE      Belgium               Nuclear  ...  41430.0  40128.5  26995.628
2      BE      Belgium                 Hydro  ...   1476.0   1360.9   1239.248
3      BE      Belgium    Pumped hydro power  ...   1110.0   1093.2    983.190
4      BE      Belgium                  Wind  ...   5340.0   6387.9   7177.346

[5 rows x 7 columns]

#  Entendendo a Estrutura dos Dados

In [ ]:
df.shape
df.info
df.columns
df.type.value_counts()
df.country_name.unique()
df.dtypes
df.describe(include = "all")

       country          country_name  ...           2017           2018
count      296                   288  ...     296.000000     296.000000
unique      37                    36  ...            NaN            NaN
top         UA  Bosnia & Herzegovina  ...            NaN            NaN
freq         8                     8  ...            NaN            NaN
mean       NaN                   NaN  ...   12910.957946   12796.198074
std        NaN                   NaN  ...   41029.499878   39423.360898
min        NaN                   NaN  ...       0.000000       0.000000
25%        NaN                   NaN  ...       0.000000       0.000000
50%        NaN                   NaN  ...     351.894000     278.354000
75%        NaN                   NaN  ...    5924.456750    6790.148750
max        NaN                   NaN  ...  379093.955000  393153.254000

[11 rows x 7 columns]

# Selecionando COLUNAS

In [ ]:
df.country_name

df['country_name'] # retorna uma Série
df[['country_name']] # retorna um Data Frame 

df[['country','country_name']]

    country country_name
0        BE      Belgium
1        BE      Belgium
2        BE      Belgium
3        BE      Belgium
4        BE      Belgium
..      ...          ...
291      GE      Georgia
292      GE      Georgia
293      GE      Georgia
294      GE      Georgia
295      GE      Georgia

[296 rows x 2 columns]

# Selecionando LINHAS

In [ ]:
df[df.country == 'UK']
df[ (df.country == 'UK') & (df.level == 'Level 2') ] # não esqueça dos parênteses

    country country_name                type  ...     2016     2017      2018
219      UK          NaN  Pumped hydro power  ...  2948.89  2862.01  2515.998

[1 rows x 7 columns]

In [ ]:
df[df.country.isin(['UK','BE'])]

    country country_name  ...        2017        2018
0        BE      Belgium  ...   31316.000   30092.635
1        BE      Belgium  ...   40128.500   26995.628
2        BE      Belgium  ...    1360.900    1239.248
3        BE      Belgium  ...    1093.200     983.190
4        BE      Belgium  ...    6387.900    7177.346
5        BE      Belgium  ...    3264.300    3488.979
6        BE      Belgium  ...       0.000       0.000
7        BE      Belgium  ...     490.900     218.509
216      UK          NaN  ...  189296.528  180837.905
217      UK          NaN  ...   63886.860   59097.753
218      UK          NaN  ...    8723.430    7678.659
219      UK          NaN  ...    2862.010    2515.998
220      UK          NaN  ...   50003.654   56903.961
221      UK          NaN  ...   11524.870   12857.349
222      UK          NaN  ...       0.000       0.000
223      UK          NaN  ...       0.000       0.000

[16 rows x 7 columns]

# Tudo junto: LINHAS e COLUNAS

In [ ]:
df[df.country == 'UK'].type

df[df.country == 'UK']['type']
df[df.country == 'UK'][['type']]

df[df.country == 'UK'][['type','level']]

                     type    level
216  Conventional thermal  Level 1
217               Nuclear  Level 1
218                 Hydro  Level 1
219    Pumped hydro power  Level 2
220                  Wind  Level 1
221                 Solar  Level 1
222            Geothermal  Level 1
223                 Other  Level 1

# Criando um SUBCONJUNTO de dados

In [ ]:
mydf = df[df.country == 'UK'][['type','level']]

df.head()
df.shape
len(df)
df.describe(include='all')

       country          country_name  ...           2017           2018
count      296                   288  ...     296.000000     296.000000
unique      37                    36  ...            NaN            NaN
top         UA  Bosnia & Herzegovina  ...            NaN            NaN
freq         8                     8  ...            NaN            NaN
mean       NaN                   NaN  ...   12910.957946   12796.198074
std        NaN                   NaN  ...   41029.499878   39423.360898
min        NaN                   NaN  ...       0.000000       0.000000
25%        NaN                   NaN  ...       0.000000       0.000000
50%        NaN                   NaN  ...     351.894000     278.354000
75%        NaN                   NaN  ...    5924.456750    6790.148750
max        NaN                   NaN  ...  379093.955000  393153.254000

[11 rows x 7 columns]

# Seleção por Localização

Esse é um recurso mais avançado e você pode deixar para retomá-lo mais adiante se quiser.

In [ ]:
df.iloc[0:10,0:2] # por índice
df.loc[0:10,['type','level']] # por rótulo

                    type    level
0   Conventional thermal  Level 1
1                Nuclear  Level 1
2                  Hydro  Level 1
3     Pumped hydro power  Level 2
4                   Wind  Level 1
5                  Solar  Level 1
6             Geothermal  Level 1
7                  Other  Level 1
8   Conventional thermal  Level 1
9                Nuclear  Level 1
10                 Hydro  Level 1

# Extraindo informações de um atributo

## Coluna inteira

In [ ]:
df['2018'].mean()
df['2018'].sum()
df['2018'].max()

df['type'].value_counts()

# df['2018'].idxmax() # avançado!!! :-)
# df.iloc[ df['2018'].idxmax() ]

Other                   37
Conventional thermal    37
Hydro                   37
Solar                   37
Wind                    37
Pumped hydro power      37
Geothermal              37
Nuclear                 37
Name: type, dtype: int64

## De uma seleção dos dados

In [ ]:
df[df.country == 'UK']['2018'].mean()
df[df.country == 'UK']['2018'].sum()

319891.625

In [ ]:
df[df.type == 'Nuclear']['2018'].mean()

23468.48602702703

# Agregações

Funcionam de forma análoga a uma `Pivot Table` (tabela dinâmica) do Excel, ou ao `group by` do SQL.

In [ ]:
df.groupby('type')['2018'].mean()
df.groupby('type')['2018'].max()
df.groupby('type')['2018'].count()

df.groupby(['level','type'])['2018'].mean()

# dfgroup = pd.DataFrame(df.groupby('type')['2018'].mean()) # avançado :-)
# dfgroup = dfgroup.reset_index()
# dfgroup

level    type
Level 1  Conventional thermal    46065.660000
         Geothermal                336.317676
         Hydro                   16540.365703
         Nuclear                 23468.486027
         Other                     216.733622
         Solar                    3539.688919
         Wind                    10846.821081
Level 2  Pumped hydro power       1355.511568
Name: 2018, dtype: float64

# Qual o percentual de Energia renovável produzida na Europa?

In [ ]:
df.type.unique()
# ['Conventional thermal', 'Nuclear', 'Hydro', 'Pumped hydro power',
#       'Wind', 'Solar', 'Geothermal', 'Other']

total_renovavel = df[ df.type.isin(['Hydro', 'Pumped hydro power', 'Wind', 'Solar', 'Geothermal', 'Other']) ]['2018'].sum()
total = df['2018'].sum()

perc_renovavel = total_renovavel / total

print('Percentual de Energia Renovável produzida na Europa: {:0.2f}'.format(perc_renovavel))

Percentual de Energia Renovável produzida na Europa: 0.32

# Qual o percentual de Energia nuclear produzida na Europa?

In [ ]:
df.type.unique()
# ['Conventional thermal', 'Nuclear', 'Hydro', 'Pumped hydro power',
#       'Wind', 'Solar', 'Geothermal', 'Other']

total_nuclear = df[ df.type == 'Nuclear' ]['2018'].sum()
total = df['2018'].sum()

perc_nuclear = total_nuclear / total

print('Percentual de Energia Nuclear produzida na Europa: {:0.2f}'.format(perc_nuclear))

Percentual de Energia Nuclear produzida na Europa: 0.23

# Qual o percentual de Energia nuclear produzida na França?

In [ ]:
df.type.unique()
# ['Conventional thermal', 'Nuclear', 'Hydro', 'Pumped hydro power',
#       'Wind', 'Solar', 'Geothermal', 'Other']

total_nuclear = df[ (df.type == 'Nuclear') & (df.country == 'FR') ]['2018'].sum()
total = df[ df.country == 'FR' ]['2018'].sum()

perc_nuclear = total_nuclear / total

print('Percentual de Energia Nuclear produzida na França: {:0.2f}'.format(perc_nuclear))

Percentual de Energia Nuclear produzida na França: 0.70

# Exercícios resolvidos e propostos

Resolva os exercícios propostos.

# **CASE:** **Board Games** 

[Board Games](https://www.kaggle.com/mrpantherson/board-game-data)

Explore os dados de Jogos de Tabuleiros.

In [ ]:
import pandas as pd
import numpy as np

df = pd.read_csv('https://meusite.mackenzie.br/rogerio/bgg_db_1806.csv', encoding = "ISO-8859-1")
df.head()

   rank  ...  weight
0     1  ...  3.7543
1     2  ...  2.8210
2     3  ...  4.3678
3     4  ...  3.2456
4     5  ...  3.5518

[5 rows x 20 columns]

# Exercício.

Explore a estrutura dos dados. 

* Quantas linhas e quantos atributos existem?
* Qual o ano mais recente de jogos da base?
* Verifique os valores de ano. Existem dados inválidos na base?
* Qual a média de idade para os jogos?

# **Exercício (Resolvido)**

Qual o valor máximo e mínimo de *rating* dos jogos (`avg_rating`)?

In [ ]:
print( df[['avg_rating']].min(), df[['avg_rating']].max() )

avg_rating    5.77773
dtype: float64 avg_rating    9.15915
dtype: float64

# Exercício

Qual o game com maior `avg_rating`?

# **Exercício (Resolvido)**

Quais os 5 jogos com maior tempo de duração média (`avg_time`).

In [ ]:
df.nlargest(5, 'avg_time')

      rank  ...  weight
2266  2267  ...  4.5821
4797  4798  ...  3.9231
966    966  ...  4.4346
942    942  ...  4.6008
1756  1757  ...  4.5111

[5 rows x 20 columns]

# Exercício.

Qual a média de idade para jogos com no máximo 10 jogadores?

# **CASE:** **Hotels:** Reservas e Cancelamentos 

[Hotels link](https://github.com/rfordatascience/tidytuesday/blob/master/data/2020/2020-02-11/readme.md)

Explore os dados de reservas de hotéis e cancelamentos.

# Lendo os Dados

In [ ]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-02-11/hotels.csv') 

df.head()

          hotel  is_canceled  ...  reservation_status  reservation_status_date
0  Resort Hotel            0  ...           Check-Out               2015-07-01
1  Resort Hotel            0  ...           Check-Out               2015-07-01
2  Resort Hotel            0  ...           Check-Out               2015-07-02
3  Resort Hotel            0  ...           Check-Out               2015-07-02
4  Resort Hotel            0  ...           Check-Out               2015-07-03

[5 rows x 32 columns]

#  Entendendo a Estrutura dos Dados

In [ ]:
df.shape
df.info
df.columns
df.hotel.value_counts()
df.country.unique()
df.dtypes
df.describe(include = "all")

             hotel    is_canceled  ...  reservation_status  reservation_status_date
count       119390  119390.000000  ...              119390                   119390
unique           2            NaN  ...                   3                      926
top     City Hotel            NaN  ...           Check-Out               2015-10-21
freq         79330            NaN  ...               75166                     1461
mean           NaN       0.370416  ...                 NaN                      NaN
std            NaN       0.482918  ...                 NaN                      NaN
min            NaN       0.000000  ...                 NaN                      NaN
25%            NaN       0.000000  ...                 NaN                      NaN
50%            NaN       0.000000  ...                 NaN                      NaN
75%            NaN       1.000000  ...                 NaN                      NaN
max            NaN       1.000000  ...                 NaN                      NaN

[11 rows x 32 columns]

# Exercício. Qual ano mais recente de reservas na base? 

DICA: empregue `arrival_date_year`

# Exercício. Crie um subset dos dados de interesse **(Resolvido)**

Crie um subset `dfyyyy` somente com dados do ano mais recente das reservas. Inclua apenas as colunas:

```
['hotel', 'is_canceled', 'lead_time', 'arrival_date_year',
       'country', 'market_segment', 'deposit_type']
```

In [ ]:
df.columns
df2017 = df[df.arrival_date_year == 2017][['hotel', 'is_canceled', 'lead_time', 'arrival_date_year',
       'country', 'market_segment', 'deposit_type']]

df2017

               hotel  is_canceled  ...  market_segment  deposit_type
9775    Resort Hotel            1  ...       Online TA    No Deposit
9776    Resort Hotel            1  ...       Online TA    No Deposit
9777    Resort Hotel            1  ...       Online TA    No Deposit
9778    Resort Hotel            1  ...       Online TA    No Deposit
9779    Resort Hotel            1  ...       Online TA    No Deposit
...              ...          ...  ...             ...           ...
119385    City Hotel            0  ...   Offline TA/TO    No Deposit
119386    City Hotel            0  ...       Online TA    No Deposit
119387    City Hotel            0  ...       Online TA    No Deposit
119388    City Hotel            0  ...       Online TA    No Deposit
119389    City Hotel            0  ...       Online TA    No Deposit

[40687 rows x 7 columns]

# Exercício. Quantas reservas registradas no Brasil no ano mais recente? **(Resolvido)**

In [ ]:
len(df2017[df.country == 'BRA'])
# df2017[df.country == 'BRA'].head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

1010

# Exercício. Qual o percentual de reservas do Brasil com relação ao total de reservas no mundo no ano mais recente?

# Exercício. Qual o percentual de reservas canceladas no ano mais recente?

# Exercício. Qual o segmento (`market_segment`) com maior *lead time* médio no ano mais recente?

# Exercício. Qual tipo de hotéis, 'City Hotel' ou 'Resort Hotel', apresenta maior percentual de cancelamentos no último ano?